{"pageProps":{"post":{"author":{"date":"Thu Apr 01 2021 18:35:06 GMT-0700 (Pacific Daylight Time)","name":"Jon","read":5},"tags":["React"],"body":[{"type":"sub","content":"React Animations"},{"type":"p","content":"There are many tools available to the React developer, some are better than others, but there are a few I would definitely recommend looking into. For the sake of this article, I’m only going to discuss react-spring in-depth — which is the animation library used for this blog.  But below are some other React animations worth looking into. "},{"type":"p","content":"React-transition-group\nFramer motion\nReact-Motion"},{"type":"sub","content":"What is react-spring?"},{"type":"p","content":"react-spring is a spring-physics based animation library that allows us to power UI animations within React."},{"type":"p","content":"Rather than the approach the development community had initially adopted, where one would look at an animation in terms of graphing functions, react-spring allows the developer to build animations based on the physical properties of a spring.\n"},{"type":"p","content":"Not only is it extremely performant and powerful, it is very simple to get up and running. DOnt get me wrong, it can be complex — but I will show you just how easy it is to start."},{"type":"sub","content":"Steps to your first react-spring animation"},{"type":"p","content":"After creating your project, you’ll start with the infamous “npm i react-spring”"},{"type":"p","content":"Then just copy and paste this code"},{"type":"code","content":"import {useSpring, animated} from 'react-spring'\n\nfunction App() {\n  const props = useSpring({opacity: 1, from: {opacity: 0}})\n  return <animated.div style={props}>I will fade in</animated.div>\n}\n\nExport default App;"},{"type":"p","content":"So the first line, imports useSpring and animated from react-spring. useSpring allows us, in this instance, to set the transition we want to see. Here we set opacity at 0 to start, and 1 to end. While not shown here, you can add a {config: …} element to useSpring and dictate the specific tension, mass, friction, ect you would like to use. There are also preset configs you can import that give a preset config such as default ( what we see now, with no config ), molasses, and stiff."},{"type":"p","content":"The animated tag we just add in-front of our element. So we could use <animated.span></animated.span> or <animated.h2></animated.h2> if we pleased. The animated tag lets react-spring know that this element can experience an animation in its lifetime, but it is not a requirement. "},{"type":"p","content":"And there you, you have successfully installed and applied react-spring to an element. "},{"type":"sub","content":"Conclusion"},{"type":"p","content":"React-spring has the ability to do nearly anything you would like. This was a simple example, showing how you can set up react-spring and how to apply it to a single element. Now they have a few different hooks you can use, and some require more intricacy than others, but if you would like to animate an entire array — you can. Want to do it in a trailing fashion? You can. Want to animate adding or removing to/from an array? Again, its do-able."},{"type":"p","content":"I highly recommend checking their website out, they have some very cool examples displaying how awesome it can be."}],"_id":"606674d9648b0e42feeeeec3","title":"The joy of react-spring","quip":" Ain’t nobody got time for graphs","mainImg":"https://res.cloudinary.com/dxtqihvgt/image/upload/v1617325376/Blog%20Images/spring_k6xy9n.png","__v":0}},"__N_SSG":true}